In [64]:
import os
import pickle
import numpy as np
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [65]:
src_train = os.path.join('..','Data', 'train.csv')
src_test = os.path.join('..','Data', 'test.csv')
src_gender_submission = os.path.join('Data', 'gender_submission.csv')

In [66]:
data = pd.read_csv(src_train)
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [67]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Handling the 'Sex' Column in the Dataset

In [68]:
encoder = LabelEncoder()
data['Sex'] = encoder.fit_transform(data['Sex'])

Male --> 1, Female --> 0

In [69]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S

## Handling the 'Embarked' Column in the Dataset

In [70]:
data["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [71]:
data["Embarked"].mode()[0]

'S'

In [72]:
data["Embarked"].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [73]:
data["Embarked"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: Embarked
Non-Null Count  Dtype
--------------  -----
889 non-null    object
dtypes: object(1)
memory usage: 7.1+ KB

In [74]:
data[data["Embarked"].isna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",0,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",0,62.0,0,0,113572,80.0,B28,NaN

In [75]:
data[(data["Fare"] >= 70) & (data["Fare"] <= 90)]['Embarked'].value_counts()

Embarked
S    25
C    19
Q     2
Name: count, dtype: int64

In [76]:
data["Embarked"].fillna('S', inplace=True)

/tmp/ipykernel_59201/3508382300.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data["Embarked"].fillna('S', inplace=True)

In [77]:
data["Embarked"].unique()

array(['S', 'C', 'Q'], dtype=object)

In [38]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,S

In [79]:
data = pd.get_dummies(data, columns=["Embarked"])

In [80]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked_C,Embarked_Q,Embarked_S
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,False,False,True
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,True,False,False
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,False,False,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,False,False,True
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,False,False,True

## Cabin

In [83]:
nan_percentage = data["Cabin"].isna().sum() /len(data) * 100
print(f"Percentage of NaN values in 'Cabin' column: {nan_percentage}")

Percentage of NaN values in 'Cabin' column: 77.10437710437711

It seems that the 'Cabin' column does not provide much useful information and should be removed.
However, we will conduct further analysis to confirm this.

In [95]:
servive_Cabin_nan = data[data["Cabin"].isna()]["Survived"].mean() * 100
print(f"Percentage of survivors with null 'cabin' column: {servive_Cabin_nan:.2f}%")

Percentage of survivors with null 'cabin' column: 29.99%

In [96]:
servive_Cabin = data[data["Cabin"].notna()]["Survived"].mean() * 100
print(f"Percentage of survivors with Not null 'cabin' column: {servive_Cabin:.2f}%")

Percentage of survivors with Not null 'cabin' column: 66.67%

We will perform a statistical test to measure the chance percentage of this difference

In [106]:
contingency_table = data[["Cabin", "Survived"]]
contingency_table["is_Missing_Cabin"] = contingency_table["Cabin"].isna().astype(int)
contingency_table

/tmp/ipykernel_59201/2704581468.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  contingency_table["is_Missing_Cabin"] = contingency_table["Cabin"].isna().astype(int)

    Cabin  Survived  is_Missing_Cabin
0     NaN         0                 1
1     C85         1                 0
2     NaN         1                 1
3    C123         1                 0
4     NaN         0                 1
..    ...       ...               ...
886   NaN         0                 1
887   B42         1                 0
888   NaN         0                 1
889  C148         1                 0
890   NaN         0                 1

[891 rows x 3 columns]

In [100]:
from scipy.stats import fisher_exact

In [107]:
contingency_table = pd.crosstab(contingency_table["is_Missing_Cabin"], contingency_table["Survived"])
contingency_table

Survived            0    1
is_Missing_Cabin
0                  68  136
1                 481  206

In [108]:
_, p_value = fisher_exact(contingency_table)

In [109]:
p_value

1.0609347619549145e-20